# Data Analytics and Visualization with Python

### Learning Objective - 

- Introduction to Analytics using Python
    - Python Basics for Analytics (Revision)
    - numpy and pandas library
    - Reading data from various sources (excel, csv, database, json)
    - Cleaning and Preparing Data
- Descriptive Statistics
- Visualizing Data
    - Introduction to matplotlib library
    - Anatomy of a figure
    - Creating sub-plots
    - Chart aesthetics
- Visual Data Analytics
    - Univariate Analysis
        - count plots
        - histograms and boxplot
    - Bivariate Analysis
        - scatter plot
        - bar plot
        - line charts
        - pair plots, heatmaps

## Python Basics for Analytics

#### Built-in data structure - 
- list  - [], mutable, mixed data, indexed
- tuples - (), immutable, mixed data, indexed
- set  - {}, mutable, no duplicates, unordered, mixed data but only immutable objects
- dict - {}, mutable, key:value, key - no duplicates, immutable object; Value - any type

#### Python Functions

- sorted(), zip(), enumerate(), lambda functions

## Working on Arrays

In [ ]:
!pip install numpy  # Install only if np is not present

In [ ]:
import numpy as np

In [ ]:
names = np.array(["Olivia", "Liam", "Emma", "Noah", "Ava", "Sophia", "Jackson", "Isabella", "Lucas", "Mia"])
maths = np.array([93, 60, 68, 53, 63, 30, 46, 63, 66, 53])
english = np.array([75, 69, 78, 66, 53, 26, 65, 62, 63, 70])
science = np.array([96, 57, 55, 52, 52, 31, 96, 58, 52, 70])

#### Array Attributes

###### How many students appreared for the exam?

In [ ]:
names.size

In [ ]:
names.dtype

In [ ]:
maths.dtype

In [ ]:
names.ndim  # dimensions of array

#### Accessing Array elemenets and Operations on Arrays

###### Ex. Who scored maximum marks in science?

In [ ]:
int(science.max())

In [ ]:
science.argmax()  # Returns the index position of largest element

In [ ]:
science == science.max()  # Returns a bool array after comparing based on condition

In [ ]:
science[science == science.max()]

In [ ]:
names[science == science.max()]

###### Ex. How many students have passed in maths?

In [ ]:
names[maths >= 35]

In [ ]:
names[maths >= 35].size

In [ ]:
sum(maths >= 35)

###### Ex. Are there any students who have failed in maths? (True or False)

In [ ]:
np.all(maths >= 35)   # returns True if all values are True else False

In [ ]:
np.any(english < 35)   # returns True if any one value is True else Falseb

In [ ]:
lst = [True, False, True, ()]
all(lst)

In [ ]:
lst = [True, True, True, ()]  # bool of empty tuple is always False
all(lst)

###### Ex. Have all students cleared their math exams (True or False)

In [ ]:
np.all(maths >= 35)

###### Ex. Who failed in maths? passing marks - 35

In [ ]:
names[maths< 35]

In [ ]:
", ".join(names[maths > 35])

###### Ex. Calculate percentage of all students and assign grades

In [ ]:
percentage = np.round((maths + english + science)/3, 2)
percentage

###### Assign grades to the students (Failed or pass)

In [ ]:
grades_1 = np.where(percentage >= 35, "Passed", "Failed")
grades_1

###### Assigning grades as A, B, C, D

In [ ]:
conditions = [percentage >= 75, percentage >= 60, percentage >= 40]
results = ["Grade A", "Grade B", "Grade C"]
np.select(conditions, results, "Grade D")

In [ ]:
help(np.select)

###### Ex. Display names of students who have scored above class average.

In [ ]:
names[percentage >= percentage.mean()]

In [ ]:
names[maths >= maths.mean()]

###### Ex. How many students are obve average in class also above avg in all three subject

In [ ]:
above_class_avg = names[percentage >= percentage.mean()]
above_maths_avg = names[maths >= maths.mean()]
above_sci_avg = names[science >= science.mean()]
above_eng_avg = names[english >= english.mean()]

In [ ]:
from functools import reduce
# product of numbers in range of 1-10
reduce(lambda x, y : x + y, range(1, 11))

In [ ]:
results = [above_class_avg, above_eng_avg, above_maths_avg, above_sci_avg]
reduce(np.intersect1d, results)

In [ ]:
np.intersect1d(np.intersect1d(np.intersect1d(above_class_avg, above_eng_avg), above_maths_avg), above_sci_avg)

## Working on Dataframes

#### Reading data from various sources (excel/csv, database, json)

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

#### Creating a Datafram from lists/arrays

In [ ]:
names = np.array(["Olivia", "Liam", "Emma", "Noah", "Ava", "Sophia", "Jackson", "Isabella", "Lucas", "Mia"])
maths = np.array([93, 60, 68, 53, 63, 30, 46, 63, 66, 53])
english = np.array([75, 69, 78, 66, 53, 26, 65, 62, 63, 70])
science = np.array([96, 57, 55, 52, 52, 31, 96, 58, 52, 70])

students = {"Name" : names, "Maths" : maths, "English" : english, "Science": science}
df = pd.DataFrame(students)
df

In [ ]:
df.shape

In [ ]:
df.dtypes

In [ ]:
df.head(2)

In [ ]:
df.tail()

In [ ]:
df[df.Maths < 35]

In [ ]:
np.all(df.Maths >= 35) # Have all the srydents passed in maths?

###### Ex. Create new columns as Total Marks, Percentage, Rank and Grade

In [ ]:
df["Total Marks"] = df.Maths + df.English + df.Science
df["Percentage"] = np.round(df["Total Marks"]/3, 2)
conditions = [df.Percentage >= 75, df.Percentage >= 60, df.Percentage >= 40]
results = ["Grade A", "Grade B", "Grade C"]
df["Grade"] = np.select(conditions, results, "Grade D")
df["Rank"] = df.Percentage.rank(ascending=False).astype(int)
df.sort_values("Rank", inplace = True, ignore_index= True)
df

###### Ex. What is AVG marks scored by students in Maths getting Grade B

In [ ]:
int(df[df.Grade == "Grade B"].Maths.mean())

### Conneting to database

In [ ]:
!pip install sqlalchemy

In [ ]:
from sqlalchemy import create_engine
conn = create_engine("sqlite:///employee.sqlite3")
conn

In [ ]:
pd.read_sql("Employee", conn)

In [ ]:
pd.read_sql_query("Select * from Employee where Designation = 'Manager'", conn)

In [ ]:
mssql://*server_name*/*database_name*?trusted_connection=yes

### Connect to Json Object

In [ ]:
import requests

In [ ]:
json_obj = requests.get("http://127.0.0.1:5000/tasks").json()

In [ ]:
pd.DataFrame(json_obj)

In [ ]:
json_obj = requests.get("https://jsonplaceholder.typicode.com/posts").json()

pd.DataFrame(json_obj)

### Read data from CSV

Method 1 - Set the current working directory as the file path

In [ ]:
import os
os.chdir(r"./Datasets/")

Method 2 - Upload the files to working environment using jupyter upload button

#### Reading data from csv file

In [ ]:
df = pd.read_csv("coffee_sales.csv", header=3)
df.head()

#### Handling null values

In [ ]:
df.dropna(axis = 1, how="all", inplace=True)
# df.dropna(how="all")
df.head()

In [ ]:
df.isna().any()

In [ ]:
df.isna().sum()

#### Remove nulls

In [ ]:
df.dropna()  # Removes all the rows where a column value is null

#### Replacing nulls

In [ ]:
df["Target Profit"].fillna("0", inplace=True)  # Older technique depricated in pandas 3.0

In [ ]:
df.fillna({"Target Profit" : "0"}, inplace=True)  # New technique (python 12.x onwards)
df.head()

In [ ]:
df.isna().any()

In [45]:
df.dtypes

Date             object
Franchise        object
City             object
Product          object
Sales            object
Profit           object
Target Profit    object
Target Sales     object
dtype: object

#### Cleaning and Preparing Data

In [47]:
strg = "($1,200)"  # -1200

In [50]:
trans_obj = str.maketrans("(", "-", "$,)")
int(strg.translate(trans_obj))

-1200

In [59]:
trans_obj = str.maketrans("", "", "$,")  # Note - use translate if more than 1 replace statements are needed
df.Sales = df.Sales.str.translate(trans_obj).astype(float)
df["Target Sales"] = df["Target Sales"].str.translate(trans_obj).astype(float)
df.Profit = df.Profit.str.replace("$", "").astype(float)
df["Target Profit"] = df["Target Profit"].str.replace("$", "").astype(float)
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,1-Jan-21,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0
1,1-Feb-21,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0
2,1-Mar-21,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0
3,1-Apr-21,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0
4,1-May-21,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0

In [60]:
df.dtypes

Date              object
Franchise         object
City              object
Product           object
Sales            float64
Profit           float64
Target Profit    float64
Target Sales     float64
dtype: object

###### Ex. Find total avg sales (HINT - use mean() in Sales column)

In [64]:
float(np.round(df.Sales.mean(), 2))

192.99

###### Ex. Find total profits generated by Product "Amaretto"

In [67]:
df[df.Product == "Amaretto"].Profit.sum()

np.float64(5915.0)

###### Ex. Find total profits generated by Product "Amaretto" and 'Caffe Latte'

In [71]:
df[df.Product.isin(("Amaretto", 'Caffe Latte'))].Profit.sum()

np.float64(17290.0)

###### Ex. Find total profits generated by Product "Amaretto" in City "Mumbai"

In [73]:
df[(df.Product == "Amaretto") & (df.City == "Mumbai")].Profit.sum()

np.float64(5915.0)

In [74]:
df[np.logical_and((df.Product == "Amaretto"),(df.City == "Mumbai"))].Profit.sum()

np.float64(5915.0)

#### Converting date field

In [77]:
df["Date"] = pd.to_datetime(df["Date"], format = "mixed")
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0
1,2021-02-01,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0
2,2021-03-01,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0
3,2021-04-01,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0
4,2021-05-01,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0

###### Ex. Total Sales in Jan-2021

In [80]:
df[df.Date == "2021-01"].Sales.sum()

np.float64(10403.0)

###### Ex. Total Sales between Jan-2021 to April-2021

In [81]:
df[df.Date.between("2021-01", "2021-04")].Sales.sum()

np.float64(45273.0)

#### Creating new columns

###### Ex. Create column for Target Status

In [84]:
df["Sales Target Status"] = np.where(df.Sales >= df["Target Sales"], "Achieved", "Not-Achieved")
df["Profit Target Status"] = np.where(df.Profit >= df["Target Profit"], "Achieved", "Not-Achieved")
df.head()

,Date,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Sales Target Status,Profit Target Status
0,2021-01-01,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not-Achieved,Not-Achieved
1,2021-02-01,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved,Not-Achieved
2,2021-03-01,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not-Achieved,Not-Achieved
3,2021-04-01,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved,Not-Achieved
4,2021-05-01,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved,Not-Achieved

###### Ex. Create columns Year and Month and place them next to Date

In [ ]:
df.insert(1, "Year", df.Date.dt.year)

In [86]:
df.insert(2, "Month", df.Date.dt.month_name())

In [87]:
df.head()

,Date,Year,Month,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Sales Target Status,Profit Target Status
0,2021-01-01,2021,January,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not-Achieved,Not-Achieved
1,2021-02-01,2021,February,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved,Not-Achieved
2,2021-03-01,2021,March,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not-Achieved,Not-Achieved
3,2021-04-01,2021,April,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved,Not-Achieved
4,2021-05-01,2021,May,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved,Not-Achieved

### Final Code ------------------------------------------------------------

In [90]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

df = pd.read_csv("coffee_sales.csv", header=3)

df.dropna(axis = 1, how="all", inplace=True)
df.fillna({"Target Profit" : "0"}, inplace=True) 

trans_obj = str.maketrans("", "", "$,")  # Note - use translate if more than 1 replace statements are needed
df.Sales = df.Sales.str.translate(trans_obj).astype(float)
df["Target Sales"] = df["Target Sales"].str.translate(trans_obj).astype(float)
df.Profit = df.Profit.str.replace("$", "").astype(float)
df["Target Profit"] = df["Target Profit"].str.replace("$", "").astype(float)

df["Sales Target Status"] = np.where(df.Sales >= df["Target Sales"], "Achieved", "Not-Achieved")
df["Profit Target Status"] = np.where(df.Profit >= df["Target Profit"], "Achieved", "Not-Achieved")

df["Date"] = pd.to_datetime(df["Date"], format = "mixed")
df.insert(1, "Year", df.Date.dt.year)
df.insert(2, "Month", df.Date.dt.month_name())

df.head()

,Date,Year,Month,Franchise,City,Product,Sales,Profit,Target Profit,Target Sales,Sales Target Status,Profit Target Status
0,2021-01-01,2021,January,M1,Mumbai,Amaretto,219.0,94.0,100.0,220.0,Not-Achieved,Not-Achieved
1,2021-02-01,2021,February,M1,Mumbai,Amaretto,140.0,34.0,50.0,140.0,Achieved,Not-Achieved
2,2021-03-01,2021,March,M1,Mumbai,Amaretto,145.0,-2.0,30.0,180.0,Not-Achieved,Not-Achieved
3,2021-04-01,2021,April,M1,Mumbai,Amaretto,45.0,11.0,20.0,40.0,Achieved,Not-Achieved
4,2021-05-01,2021,May,M1,Mumbai,Amaretto,120.0,13.0,30.0,120.0,Achieved,Not-Achieved